In [62]:
pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.22.4 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/Milly/Library/Python/3.9/lib/python/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /Users/Milly/Library/Python/3.9/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [63]:
name = "Cobee"
name

'Cobee'

In [64]:
number = 8
number

8

# Machine Learning
There are 7 steps in machine learning :
- Collecting Data 
- Preparing the Data
- Choose a Model
- Training the Model
- Evaluating the Model
- Parameter Tuning
- Making prediction

In [65]:
import pandas as pd #Import pandas with alias pd
data = [1,2,3]
df = pd.DataFrame(data) #Converting a list to a dataframe
df

   0
0  1
1  2
2  3

In [66]:
student = [['Tom', 90], ['Jack', 80], ['Jill', 70]] #Create a 2D list for 2 Columns
data_student = pd.DataFrame(student, columns=['Name', 'Grade']) #'Name' , 'Grade' Is Column header
data_student

   Name  Grade
0   Tom     90
1  Jack     80
2  Jill     70

In [67]:
new_student = [['Sam', 60], ['Mary', 50], ['John', 40], ['Joseph', 30]]
new_student= pd.DataFrame(new_student, columns=['Name', 'Grade'])
data_student=pd.concat([data_student, new_student], ignore_index=True) #combine 2 dataframes 
data_student

     Name  Grade
0     Tom     90
1    Jack     80
2    Jill     70
3     Sam     60
4    Mary     50
5    John     40
6  Joseph     30

In [68]:
data_student.head(3)

   Name  Grade
0   Tom     90
1  Jack     80
2  Jill     70

In [69]:
data_student.tail(3)

     Name  Grade
4    Mary     50
5    John     40
6  Joseph     30

In [71]:
data_student.to_csv('data_student.csv')

In [72]:
student = [['Jhony', 'Swimming', 'male'], ['Catherine', 'Drawing', 'female'], ['Jack', 'Gaming', 'male']]
data_student = pd.DataFrame(student, columns=['Name', 'Hobby', 'Gender']) 
data_student

        Name     Hobby  Gender
0      Jhony  Swimming    male
1  Catherine   Drawing  female
2       Jack    Gaming    male